app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
     @authors = Author.find(params[:id]) #reccupere l'id de l url

INSERT INTO "authors" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "crypted_password", "email", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create              # le submit va chercher la methode create
  @authors = Author.new(author_params)

  @authors.username = params[:author][:username]  # on reccupere le nom du form
  @authors.email = params[:author][:email] # on reccupere le body du form
  @authors.password = params[:author][:password] # on reccupere le body du form
  @authors.password_confirmation = params[:author][:password_confirmation] # on reccupere le b
  @authors.avatar = params[:author][:avatar] # on reccupere le body
  @authors.nom = params[:author][:nom]
  @authors.prenom =  params[:author][:prenom]
  @authors.sexe =  params[:author][:sexe]
  @authors.save   #on sauvegarde

UPDATE "authors" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "authors"."id" = 9  [["avatar_file_name", "IMG_73689655224592.jpeg"], ["avatar_file_size", 19748], ["avatar_updated_at", Thu, 28 Nov 2013 11:03:22 UTC +00:00], ["updated_at", Thu, 28 Nov 2013 11:03:22 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)