app/controllers/commentaires_controller.rb

INSERT INTO "commentaires" ("author_id", "author_name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 2], ["author_name", "sxsxsxs"], ["body", "xsxsxsxs"], ["created_at", Sat, 12 Oct 2013 21:17:58 UTC +00:00], ["updated_at", Sat, 12 Oct 2013 21:17:58 UTC +00:00]]
---
def create              # le submit va chercher la methode create

 #@user=current_user
  @commentaires = Commentaire.new(commentaire_params)

   @commentaires.author_id = params[:author_id]

   @commentaires.author_name=current_user.username

  @commentaires.save   #on sauvegarde