app/controllers/invitations_controller.rb

SELECT "invitations".* FROM "invitations"
---
def index

@invitations=Invitation.all

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT 1  [["id", "bleu3"]]
---
def show

	@invitation=Invitation.find(params[:id])

INSERT INTO "invitations" ("author_id", "created_at", "description", "titre", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_id", 3], ["created_at", Sun, 17 Nov 2013 22:48:58 UTC +00:00], ["description", "le spectacle de l année"], ["titre", "bigard"], ["updated_at", Sun, 17 Nov 2013 22:48:58 UTC +00:00]]
---
def create              # le submit va chercher la methode create



  @invitations = Invitation.new(profil_params)
  var = params[:invitation][:dateinvitation]  # on reccupere le nom du form
  heure=params[:heure1]
  minute=params[:minute1]
  seconde="00"
  var3=var + " " + heure + ":" + minute + ":" + seconde

  @invitations.dateinvitation = DateTime.parse(var3)
  @invitations.titre = params[:invitation][:titre]  # on reccupere le nom du form
  @invitations.description = params[:invitation][:description]  # on reccupere le nom du form
  @invitations.avatar = params[:invitation][:avatar]  # on reccupere le nom du form

  @invitations.author_id =current_user.id
  @invitations.save   #on sauvegarde

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "invitations" SET "validation" = ?, "updated_at" = ? WHERE "invitations"."id" = 4  [["validation", true], ["updated_at", Sun, 08 Dec 2013 14:12:42 UTC +00:00]]
---
def update


@invitations=Invitation.find(params[:id])

@invitations.update_attributes(:validation => 'true')

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "invitations" SET "titre" = ?, "updated_at" = ? WHERE "invitations"."id" = 3  [["titre", "baba"], ["updated_at", Sun, 08 Dec 2013 03:18:29 UTC +00:00]]
---
def destroy
    @invitations=Invitation.find(params[:id])

@invitations.update_attributes(:titre => 'baba')