app/controllers/pagemembres_controller.rb

def index

a=0


@author2=Author.find(:all,
                     :conditions => "",
                      :order      =>  "id DESC",
                      :limit      =>  4,
                       :offset      =>  a*4)     # numero de page qu on souhaite afficher
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]

def show

    a=params[:id]


@author2=Author.find(:all,
                     :conditions => "",
                      :order      =>  "id DESC",
                      :limit      =>  4,
                       :offset      =>  a.to_i*4)     # a.to_i converti la string en int
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]