app/controllers/profils_controller.rb

SELECT "profils".* FROM "profils"
---
def index

	@profils=Profil.all